app/controllers/comments_controller.rb

  def index
    @location = Location.find(params[:location_id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 1]]