app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "address", "description", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "US Army"], ["address", "1125 15th St NW Washington, DC 20005"], ["description", "Awesomeee bathroooomm"], ["latitude", 38.9044341], ["longitude", -77.03412159999999]]
---
  def create
    @location = Location.new(location_params)

    if @location.save

UPDATE "locations" SET "name" = $1 WHERE "locations"."id" = $2  [["name", "Assembly General"], ["id", 2]]
---
  def update
    if @location.update(location_params)

DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 5]]
---
  def destroy
    @location.destroy